
#! Введение в проектирование экспериментов

#* Машинное обучение (ML) — это область компьютерных наук, которая использует алгоритмы для создания
#* и обучения моделей для выполнения рутинных задач. 

#* Точность модели (accuracy) машинного обучения определяется как процент правильных прогнозов для
#* тестовых данных и рассчитывается путём деления количества правильных прогнозов на общее количество
#* прогнозов. Обычно это определяющий фактор при оценке успеха проекта машинного обучения — чем выше
#* точность, тем лучше работает модель машинного обучения. 